Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_012/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 15.299ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 15.276ms, rate sampling interval: 32ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.25ms    3.11ms  59.30ms   80.06%
    Req/Sec   151.93     74.97   406.00     74.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.65ms
 75.000%   16.72ms
 90.000%   18.56ms
 99.000%   26.91ms
 99.900%   38.33ms
 99.990%   51.20ms
 99.999%   54.85ms
100.000%   59.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.687     0.000000            1         1.00
      12.223     0.100000         5110         1.11
      12.847     0.200000        10205         1.25
      13.399     0.300000        15317         1.43
      13.975     0.400000        20399         1.67
      14.655     0.500000        25502         2.00
      15.023     0.550000        28078         2.22
      15.399     0.600000        30603         2.50
      15.807     0.650000        33165         2.86
      16.247     0.700000        35694         3.33
      16.719     0.750000        38250         4.00
      16.975     0.775000        39502         4.44
      17.247     0.800000        40787         5.00
      17.535     0.825000        42103         5.71
      17.823     0.850000        43364         6.67
      18.175     0.875000        44638         8.00
      18.351     0.887500        45230         8.89
      18.559     0.900000        45874        10.00
      18.831     0.912500        46504        11.43
      19.167     0.925000        47143        13.33
      19.631     0.937500        47777        16.00
      19.919     0.943750        48097        17.78
      20.255     0.950000        48422        20.00
      20.687     0.956250        48736        22.86
      21.183     0.962500        49049        26.67
      21.743     0.968750        49374        32.00
      22.095     0.971875        49523        35.56
      22.591     0.975000        49683        40.00
      23.183     0.978125        49841        45.71
      23.823     0.981250        50001        53.33
      24.607     0.984375        50158        64.00
      25.199     0.985938        50240        71.11
      25.759     0.987500        50319        80.00
      26.463     0.989062        50397        91.43
      27.279     0.990625        50478       106.67
      28.031     0.992188        50556       128.00
      28.463     0.992969        50596       142.22
      28.863     0.993750        50637       160.00
      29.471     0.994531        50676       182.86
      29.935     0.995313        50716       213.33
      30.943     0.996094        50755       256.00
      31.535     0.996484        50777       284.44
      32.271     0.996875        50795       320.00
      33.023     0.997266        50815       365.71
      33.823     0.997656        50835       426.67
      34.783     0.998047        50855       512.00
      35.487     0.998242        50865       568.89
      36.255     0.998437        50875       640.00
      36.767     0.998633        50885       731.43
      37.887     0.998828        50895       853.33
      38.495     0.999023        50905      1024.00
      39.327     0.999121        50910      1137.78
      39.455     0.999219        50915      1280.00
      40.255     0.999316        50920      1462.86
      41.375     0.999414        50925      1706.67
      42.495     0.999512        50930      2048.00
      42.591     0.999561        50933      2275.56
      42.687     0.999609        50935      2560.00
      43.999     0.999658        50937      2925.71
      45.439     0.999707        50940      3413.33
      46.527     0.999756        50942      4096.00
      46.783     0.999780        50943      4551.11
      48.255     0.999805        50945      5120.00
      48.383     0.999829        50946      5851.43
      49.215     0.999854        50947      6826.67
      49.247     0.999878        50948      8192.00
      51.199     0.999890        50949      9102.22
      54.239     0.999902        50950     10240.00
      54.239     0.999915        50950     11702.86
      54.463     0.999927        50951     13653.33
      54.463     0.999939        50951     16384.00
      54.815     0.999945        50952     18204.44
      54.815     0.999951        50952     20480.00
      54.815     0.999957        50952     23405.71
      54.847     0.999963        50953     27306.67
      54.847     0.999969        50953     32768.00
      54.847     0.999973        50953     36408.89
      54.847     0.999976        50953     40960.00
      54.847     0.999979        50953     46811.43
      59.327     0.999982        50954     54613.33
      59.327     1.000000        50954          inf
#[Mean    =       15.250, StdDeviation   =        3.113]
#[Max     =       59.296, Total count    =        50954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  54002 requests in 3.00m, 43.93MB read
Requests/sec:    299.99
Transfer/sec:    249.89KB